Repository: feriyalsusanto/untukmu-revamp-app
Catalog: lib/l10n/app_*.arb
Languages: id

# whatsapp_dialog_desc
source: We can help you get this gift, talk to our sales assistant
id: Kami dapat membantu Anda mendapatkan hadiah ini, berbicaralah dengan asisten sales kami

source: Example
id: Contoh

source: Ask something...
id: Tanyakan sesuatu...

# reset_conversation_confirmation
source: Reset conversation?
id: Hapus percakapan?

# reset_conversation_confirmation_desc
source: Are you sure to reset this conversation?
id: Apakah anda yakin ingin menghapus percakapan ini?

source: Resend
id: Kirim ulang

# ask_receive_any_code
source: Didn’t you receive any code?
id: Apakah anda sudah menerima kode verifikasi?

# resend_otp
source: Resend OTP Code
id: Kirim kode OTP

source: Otp Verification
id: Verifikasi OTP

# check_wa_otp
source: Check your WhatsApp to see the verification code
id: Cek WhatsApp anda untuk melihat kode verifikasi

source: History
id: Riwayat

# your_point
source: Your current point
id: Poin anda sekarang

source: You
id: Anda

source: Continue as Guest
id: Lanjutkan sebagai tamu

# register_order_dialog_button_title
source: Register
id: Daftar

# register_order_dialog_desc
source: Register on Untukmu to purchase this product
id: Silahkan daftar Untukmu untuk membeli produk ini

# find_recommendation_product
source: Hey {character}! I need gift recommendation for {event}
id: Halo {character}! aku perlu rekomendasi hadiah untuk {event}

# what_your_interest
source: What is your interest?
id: Apa saja yang anda minati?

source: Skip
id: Lewati

# add_address_detail
source: Add Your Address Details
id: Tambahkan Detail Alamat Anda

# add_address_detail_desc
source: You can help people to sent a gift easily by adding your address details. Don''t worry, your information is safe with us.
id: Anda dapat membantu orang mengirim hadiah dengan mudah dengan menambahkan detail alamat Anda. Jangan khawatir, kami merahasiakan alamat Anda.

source: Use your point
id: Pakai poin anda

source: Use Point
id: Pakai Poin

source: Point Left
id: Sisa Poin

# continue_text
source: Continue
id: Lanjut

# add_new_recipient
source: Add new gift recipients, you can also import from contacts on your device
id: Tambahkan penerima hadiah baru, anda juga bisa mengimpor dari kontak di perangkat anda

# registered_user
source: {name} is a registered member
id: {name} adalah anggota terdaftar

# use_address_question
source: Would you like to use her dedicated address to send the gift?
id: Apakah Anda ingin menggunakan alamat khusus dia untuk mengirim hadiah?

# use_address_warning
source: {name} set their address in private. But don’t worry, we will sent the gift to their dedicated address.
id: {name} menetapkan alamat mereka secara pribadi. Namun jangan khawatir, kami akan mengirimkan hadiah ke alamat khusus mereka.

# use_address_agree
source: Yes, I want to use this
id: Ya, saya ingin menggunakan ini

# use_address_diagree
source: No, I want to fill it manually
id: Tidak, saya ingin mengisinya secara manual

source: Confirm
id: Konfirmasi

source: Your Contact
id: Kontak Anda

source: Contact Name
id: Nama Kontak

source: Search Name
id: Cari Nama

# recent_recipient
source: Recent Contact
id: Kontak Sebelumnya

# find_recipient_empty
source: You don''t have a gift recipient yet, please click here to add a new gift recipient
id: Anda belum memiliki penerima hadiah, silahkan klik disini untuk menambah penerima hadiah baru

source: Consignee
id: Penerima

# confidential_address
source: (consignee address is confidential)
id: (penerima merahasiakan alamatnya)

source: More
id: Lainnya

# share_chat
source: Hi, I''m looking for a gift with the Untukmu AI app. You can see my conversation here {link}
id: Hi, saya sedang mencari hadiah dengan Untukmu AI. Kamu bisa melihat percakapan saya disini {link}

source: Try again
id: Coba lagi

# empty_point_history_title
source: No Transactions Yet
id: Belum ada Transaksi

# empty_point_history_desc
source: You have not used your points to make a transaction
id: Kamu belum menggunakan poin kamu untuk melakukan transaksi

source: FAQ
id: Pertanyaan Umum

source: Terrible
id: Sangat Buruk

source: Bad
id: Buruk

source: Average
id: Biasa

source: Good
id: Baik

source: Excellent
id: Sangat Baik

# thanks_feedback
source: Thank you for your feedback!
id: Terima kasih atas masukan Anda!

# dewi_button_tooltip
source: Dewi Button
id: Tombol Dewi

# press_dewi_button_tooltip
source: Press this button to start a Gifting session with Dewi
id: Tekan tombol ini untuk memulai sesi Memberi Hadiah bersama Dewi

# report_issue_chat_title
source: Report Issue
id: Laporkan Masalah

# report_issue_chat_desc
source: Here you can provide all the information you have about the issue. If possible, please add the steps you took to encounter the error/issue.
id: Silakan berikan seluruh informasi yang Anda miliki tentang masalah yang anda hadapi, termasuk langkah-langkah yang Anda lakukan untuk menemui kesalahan/masalah jika memungkinkan.

# report_issue_chat_hint
source: Description
id: Deskripsi

source: Send
id: Kirim

# report_issue_chat_url
source: Conversation URL:
id: Link Percakapan:

source: Find New Gift
id: Hadiah Baru

source: Share
id: Bagikan

source: Thank You
id: Terima Kasih

# report_send
source: Report submitted successfully!
id: Laporan berhasil dikirimkan!

# blibli_buy_button
source: Buy at Blibli
id: Beli di Blibli

# blibli_fulfilled
source: Fulfilled by Blibli
id: Dipenuhi oleh Blibli

# delivery_address_label
source: Delivery Address
id: Alamat Pengiriman

# order_summary_label
source: Order Summary
id: Ringkasan Pesanan

# notes_order_add_label
source: Add Notes
id: Tambah Catatan

# notes_order_edit_label
source: Edit Notes
id: Edit Catatan

# notes_order_title
source: Add notes to your order
id: Tambahkan catatan ke pesanan Anda

# notes_order_field_hint
source: Add a personal note or special instructions
id: Tambahkan catatan atau instruksi khusus

# find_a_gift_label
source: Find a gift
id: Cari hadiah

source: Reset
id: Atur Ulang

# updater_title
source: A new update is available
id: Versi baru telah tersedia

# updater_desc
source: A new version of the app is now available. Would you like to update now to version {version} ?
id: Versi baru aplikasi kini tersedia. Apakah Anda ingin memperbarui sekarang ke versi {version} ?

# updater_release_note
source: What''s new on this version:
id: Apa yang baru di versi ini:

source: Update now
id: Update sekarang

source: Update later
id: Update nanti

source: Contact list
id: Daftar kontak

source: Add New Contact
id: Tambah Kontak Baru

# add_recipient
source: Add Recipients
id: Tambah Penerima

# confidential_recipient_address
source: (This user set their address as private)
id: (Pengguna ini menetapkan alamatnya sebagai privasi)

# unset_recipient_address
source: (You haven''t set their address yet)
id: (Anda belum menetapkan alamat tujuan)

source: Set Address
id: Tetapkan Alamat

# my_contacts
source: My Contacts ({total})
id: Kontak Saya ({total})

source: Quantity
id: Jumlah

source: Failed
id: Gagal

source: Invalid format
id: Format Salah

# invalid_format_phone_number
source: Invalid phone number format, please check again
id: Anda salah memasukkan format telepon, mohon check kembali

source: Add birthday
id: Atur tgl lahir

source: Set Phone
id: Atur No Telp

# unset_recipient_phone
source: (You haven''t set their phone number yet)
id: (Anda belum menetapkan no telp)

# change_character_confirmation
source: Switch to
id: Ganti ke

# change_character_confirmation_desc
source: Switching your character or language will restart your conversation from the beginning, and all previous messages will be deleted. Are you sure you want to proceed with changing your character or language?
id: Mengganti karakter atau bahasa akan memulai kembali percakapan Anda dari awal, dan semua pesan sebelumnya akan dihapus. Apakah Anda yakin ingin melanjutkan dengan mengubah karakter atau bahasa Anda?

source: Your Privacy Matters
id: Privasi Anda Penting

# your_privacy_matters_desc
source: By tapping "Agree", you allow us to upload and store your personal data on our secure server. Your trust is our top priority, and we promise to handle your information responsibly. By continuing, you confirm you''ve read and agreed to our
id: Dengan mengetuk "Setuju", Anda mengizinkan kami mengunggah dan menyimpan data pribadi Anda di server aman kami. Kepercayaan Anda adalah prioritas utama kami, dan kami berjanji untuk menangani informasi Anda secara bertanggung jawab. Dengan melanjutkan, Anda mengonfirmasi bahwa Anda sudah membaca dan menyetujui

source: Agree
id: Setuju

# add_recipent_title
source: Add recipient
id: Tambahkan penerima

# add_recipent_desc
source: Please add one or more recipients by tapping the check circle in the contact list item
id: Silakan tambahkan satu atau lebih penerima dengan mengetuk lingkaran centang di item daftar kontak

# privacy_info
source: We encrypt and securely store their details to make gift-sending easier, safeguarding their information just as we protect yours.
id: Kami mengenkripsi dan menyimpan data mereka dengan aman untuk mempermudah pengiriman hadiah, menjaga informasi mereka sama seperti kami melindungi informasi Anda.

source: Set
id: Atur

source: Yes
id: Ya

source: No
id: Tidak

source: Whatsapp Number
id: Nomor Whatsapp

source: Verify
id: Verifikasi

# recipient_name
source: Recipient''s Full Name
id: Nama Lengkap Penerima

# edit_recipient_name_title
source: Edit Recipient Name
id: Edit Nama Penerima

# edit_recipient_name_hint
source: Input recipient''s Full Name
id: Masukkan nama lengkap penerima

source: Detail Address
id: Keterangan Alamat

# detail_address_hint
source: Street Name, Building, House Number (Example: Perum Untukmu Blok C No. 11)
id: Nama Jalan, Gedung, No. Rumah (Contoh: Perum Untukmu Blok C No 11)

# prov_city_district_label
source: Province / City / District
id: Provinsi / Kota / Kecamatan / Desa

# prov_city_district_hint
source: Informasi Provinsi/Kota atau Kabupaten/Kecamatan/Desa atau Kecamatan
id: Keterangan Provinsi / Kota atau Kabupaten / Kecamatan / Desa atau Kelurahan

source: Confirm Profile Address
id: Konfirmasi Alamat

source: Search Product Now
id: Cari Produk Sekarang
