Repository: feriyalsusanto/untukmu-revamp-app
Catalog: lib/l10n/app_*.arb
Languages: id

# welcome
source: Find the Perfect Gift, Every Time
id: Temukan Hadiah yang Sempurna, Setiap Waktu

# tagline
source: To the easiest ways to bring others joy
id: Dengan cara paling mudah untuk membuat orang lain merasa senang

# phone_number_label
source: Phone Number
id: Nomor Telepon

# google_sign_label
source: Sign in with Google
id: Masuk dengan Google

# apple_sign_label
source: Sign in with Apple
id: Masuk dengan Apple

# whatsapp_sign_label
source: Sign in with WhatsApp
id: Masuk dengan WhatsApp

# facebook_sign_label
source: Sign in with Facebook
id: Masuk dengan Facebook

# greet_morning_label
source: Good morning {name} 👋
id: Selamat pagi {name} 👋

# greet_afternoon_label
source: Good afternoon {name} 👋
id: Selamat siang {name} 👋

# greet_evening_label
source: Good evening {name} 👋
id: Selamat malam {name} 👋

# language_label
source: Language
id: Bahasa

# setting_label
source: Settings
id: Pengaturan

# navbar_home
source: Home
id: Beranda

# navbar_categories
source: Categories
id: Kategori

# navbar_calendar
source: Calendar
id: Kalender

# navbar_activities
source: Activity
id: Aktivitas

# navbar_profile
source: Profile
id: Profil

source: Name
id: Nama

source: Phone Number
id: Nomor Telepon

source: Select Religion
id: Pilih Agama

source: Interest
id: Minat

source: Save Profile
id: Simpan Profil

source: Incomplete data.
id: Data tidak lengkap.

# fill_all_data
source: Please fill in all required fields and try again.
id: Harap lengkapi semua kolom yang wajib diisi dan coba kembali.

source: Success
id: Berhasil.

# data_updated
source: Data updated successfully
id: Data berhasil diperbarui.

source: Full Name
id: Nama Lengkap

source: Gender
id: Jenis Kelamin

source: Male
id: Laki-laki

source: Female
id: Perempuan

source: Place of Birth
id: Tempat Lahir

source: Date of Birth
id: Tanggal Lahir

source: Full address
id: Alamat Lengkap

source: Postal Code
id: Kode Pos

source: Notes
id: Catatan

source: Save
id: Simpan

# contact_saved
source: Contact saved successfully.
id: Kontak berhasil tersimpan.

source: Edit Contact
id: Ubah Kontak

source: Fill Identity
id: Isi Identitas

# fill_your_identity
source: Complete Your Identity
id: Lengkapi Identitas Anda

source: Account
id: Akun

source: Orders
id: Pesanan

source: Contacts
id: Kontak

source: Address
id: Alamat

# cards_payment
source: Cards and Payment
id: Kartu dan Pembayaran

source: Settings
id: Pengaturan

source: Language
id: Bahasa

# terms_conditions
source: Terms & Condition
id: Syarat & Ketentuan

source: Privacy Policy
id: Kebijakan Privasi

source: Help & Support
id: Bantuan & Dukungan

source: Get Help
id: Dapatkan Bantuan

source: Log Out
id: Keluar

source: Delete Account
id: Hapus Akun

# what_can_i_do
source: Let"s send a gift
id: Ayo kita kirim hadiah

# upcoming_event
source: Upcoming Events
id: Event yang Akan Datang

source: See All
id: Lihat Semua

# gift_someone_label
source: I want to gift someone
id: Beri hadiah untuk orang lain

# gift_myself_label
source: I want to gift myself
id: Berikan hadiah untuk saya

# how_may_assist_label
source: How may I assist you today?
id: Bagaimana saya bisa membantu Anda hari ini?

# welcome_back_label
source: Welcome back
id: Selamat datang kembali

# what_occasion_narration_label
source: Sure, What''s the occasion you want to celebrate with them?
id: Tentu, event apa yang ingin Anda rayakan bersama mereka?

# some_occasion_label
source: Here some occasion for you:
id: Berikut beberapa event untuk Anda:

# lets_find_contact_label
source: Great! Let''s find a contact to send the gift.
id: Silahkan tambahkan kontak yang ingin anda kirimkan hadiah

# find_recipient_label
source: Find the recipient you want to send
id: Temukan penerima yang ingin Anda kirimkan hadiah.

# my_recommendation_product_label
source: Here are my recommendations products for celebrating {event_name}
id: Berikut rekomendasi produk dari saya untuk merayakan {event_name}.

# has_calculated_shipping_narration_label
source: I have calculated your shipping cost, please review it before confirming your order.
id: Saya telah menghitung biaya pengiriman Anda, silakan tinjau kembali sebelum mengkonfirmasi order Anda.

# another_product_label
source: Another Product
id: Produk lainnya

source: Total Recipient
id: Total Penerima

# add_gifting_card_label
source: Want to add Gifting card?
id: Ingin menambahkan kartu ucapan?

# choose_payment_method_narration_label
source: Before I calculate your total cost, please choose your payment method first.
id: Sebelum saya menghitung total biaya pembelian, pilih metode pembayaran Anda terlebih dahulu.

source: Payment Code
id: Kode Pembayaran

source: Payment Deadline
id: Batas Waktu Pembayaran

# payment_expires_in
source: Pay within {counter} before the Virtual Account No. expired
id: Bayar dalam waktu {counter} sebelum Nomor Virtual Account kadaluwarsa.

# account_number
source: Virtual Account Number
id: Nomor Virtual Account

# how_to_payment
source: How to make payment
id: Cara membuat pembayaran

# check_purchase_history
source: Check your purchase history
id: Periksa riwayat pembelian Anda

source: Copied to clipboard
id: Disalin ke clipboard

source: Bank Payment Instructions
id: Instruksi Pembayaran Bank

source: Next
id: Lanjut

source: Edit Address
id: Ubah Alamat

source: See Detail
id: Lihat Detail

source: Stock
id: Stok

# description_product
source: Product Description
id: Deskripsi Produk

source: Customer Review
id: Ulasan Pelanggan

source: Price
id: Harga

# continue_buy
source: Continue to Buy
id: Lanjutkan Pembelian

# search_contact
source: Search contacts
id: Cari kontak

# contact_not_found_create
source: Contact not found. Would you like to create a new contact?
id: Kontak tidak ditemukan. Apakah Anda ingin membuat kontak baru?

source: Create New Contact
id: Buat Kontak Baru

source: Add
id: Tambahkan

# days_ago
source: {days} days ago
id: {days} hari yg lalu

# in_days
source: in {days} days
id: {days} hari lagi

source: Today
id: Hari Ini

source: Upcoming
id: Akan datang

source: Total Order Cost
id: Total Biaya Pemesanan

source: Platform Fee
id: Biaya Platform

source: Total Price
id: Total Biaya

source: Gifting Card
id: Kartu Ucapan

source: FREE
id: GRATIS

source: Proceed Payment
id: Proses Pembayaran

source: Your place of birth
id: Tempat kelahiran anda

# full_address_hint
source: Full address with house/apartment numbers
id: Alamat lengkap anda disertai dengan nomor rumah

source: Your postal code
id: Kode pos alamat anda

# notes_label
source: e.g: building no, house color, etc
id: contoh: nomor rumah, warna rumah, dll

source: Birthday
id: Tanggal Lahir

source: Change
id: Ubah

source: Shipping from
id: Pengiriman dari

# product_left
source: left
id: tersisa

source: Cancel
id: Batalkan

source: I want this
id: Saya ingin ini

# gifting_card_message_hint
source: Wishing you all the happiness someone as nice as you deserves.
id: Semoga kebahagiaan selalu menyertai Anda yang begitu luar biasa layaknya diri Anda.

source: Messages
id: Pesan

# gifting_card_narrator_label
source: Add color to your gifts with our gift cards. Choose your design now.
id: Tambahkan warna pada hadiahmu dengan kartu hadiah kami. Pilih desainmu sekarang.

source: Back
id: Kembali

source: Create Contact
id: Tambah Kontak

# empty_contact_label
source: You haven''t add any contact yet.
id: Anda belum menambahkan kontak apapun.

# empty_contact_description
source: Add contact to sent a gift
id: Tambahkan kontak untuk mengirimkan hadiah.

# empty_chat_description
source: You haven''t had a conversation with the gift merchant yet
id: Anda belum ada percakapan dengan merchant gift

# import_contact_label
source: Import Phone Contact
id: Import Kontak Seluler

# track_package
source: Track
id: Lacak

source: Track your package
id: Lacak paket Anda

# enter_track_package_hint
source: Enter your tracking number
id: Masukkan nomor tracking Anda

source: Transaction Fee
id: Biaya Transaksi

source: Copy
id: salin

# login_greet
source: I''m Dewi, your virtual AI assistant
id: Saya Dewi, virtual AI assisten anda

# select_preferred_lang
source: Select your preferred language
id: Tentukan bahasa pilihan Anda

source: Pending
id: Menunggu

source: Paid
id: Terbayar

source: On Process
id: Diproses

source: Shipped
id: Dikirim

source: Delivered
id: Terkirim

source: Cancelled
id: Dibatalkan

# send_whatsapp_label
source: Send WhatsApp
id: Kirim ke WhatsApp

# whatsapp_message_notify_template
source: Hi {name}, Good news! I have a special gift for you and you can track its delivery status on the Untukmu App. To track your delivery, please click this link: {trackingdeeplink}. Alternatively, you can also copy the airway bill number {trackingnumber} and paste it on track item section on homepage. If you haven''t downloaded the app yet, you can find it on the Playstore on this link below https://untukmu.ai/download Enjoy your gift!
id: Halo {name}, Kabar baik! Saya memiliki hadiah spesial untuk anda dan anda bisa melacak status pengirimannya di Aplikasi Untukmu. Untuk melacak pengirimannya, silakan klik tautan ini: {trackingdeeplink}. Atau, anda juga dapat menyalin nomor resi {trackingnumber} dan menempelkannya di bagian lacak kiriman pada halaman utama. Jika anda belum mengunduh aplikasinya, anda bisa menemukannya di Playstore di alamat berikut ini https://untukmu.ai/download Nikmati hadiahmu!

# share_info_friend_label
source: Share with your contact
id: Bagikan dengan kontak Anda

# see_trx_detail_label
source: View Transaction Details
id: Lihat detail transaksi

source: Order Status
id: Status Pesanan

# info_shipping
source: Shipping Information
id: Informasi Pengiriman

source: Download Invoice
id: Unduh Invoice

# detail_transaction_title
source: Detail Transaction
id: Detail Transaksi

source: ID Transaction
id: ID Transaksi

source: Order Date
id: Tanggal Pembelian

# total_product_price
source: Total Item Price
id: Total Harga Product

# gifting_to_recipient
source: Gifting to: {total} Recipient
id: Gifting kepada: {total} Recipient

source: Order History
id: Histori Pembelian

source: Total Shipping
id: Total Pengiriman

source: Payment Details
id: Rincian Pembayaran

# empty_order_label
source: No Order Yet
id: Belum ada pemesanan

# empty_order_description
source: You haven''t placed any orders yet. When you do, they''ll appear here
id: Belum ada data untuk kategori ini

# no_internet_label
source: Unable to Connect to the Internet
id: Tidak dapat Terhubung ke Internet

# no_internet_desc
source: We''re sorry, it seems like we''re having trouble connecting to the internet. Please check your internet connection and try again.
id: Maaf, sepertinya kami mengalami masalah saat terhubung ke internet. Silakan periksa koneksi internet Anda dan coba lagi.

# discover_title_1
source: Create lasting memory by picking the perfect occasion.
id: Ciptakan kenangan abadi dengan memilih acara yang tepat.

# discover_subtitle_1
source: Swipe to continue
id: Geser untuk melanjutkan

# discover_title_2
source: Add a Personal Touch and Make Your Gift One-of-a-Kind.
id: Tambahkan Sentuhan Personal dan Buat Hadiahmu Lebih Spesial.

# discover_subtitle_2
source: Swipe to continue
id: Geser untuk melanjutkan

# discover_title_3
source: Create lasting memory by picking the perfect occasion.
id: Temukan Ide Hadiah Terbaik untuk Orang Tersayangmu disini.

# discover_subtitle_3
source: Swipe to continue
id: Geser untuk melanjutkan

# no_address_title
source: You haven''t put any address
id: Anda belum memasukkan alamat

# no_address_desc
source: Add your address for shipping
id: Tambahkan alamat Anda untuk pengiriman

# detail_product_title
source: Product Description
id: Deskripsi Produk

source: Courier
id: Kurir

source: Tracking Number
id: No. Resi

source: Delete Contact
id: Hapus Kontak

# delete_contact_confirmation
source: Delete This Contact?
id: Hapus Kontak Ini?

# delete_contact_confirmation_desc
source: Are you sure to delete this contact?
id: Apakah Anda ingin menghapus kontak ini?

# no_answer
source: No
id: Tidak

# yes_answer
source: Yes
id: Ya

source: Contact Deleted
id: Kontak terhapus

# write_review
source: Write a Review
id: Tulis Review

# give_feedback_label
source: Give your feedback
id: Berikan ulasan Anda

# feedback_input_hint
source: What did you like about it? What could we improve? We''re all ears
id: Apa yang Anda sukai tentang itu? Apa yang bisa kami perbaiki? Kami siap mendengarkan.

# success_review_title
source: Thank You for Your Review
id: Terima Kasih atas ulasan Anda.

# success_review_desc
source: We appreciate your review! Your feedback helps us improve and other shoppers make better decisions.
id: Kami sangat menghargai ulasan Anda! Masukan Anda membantu kami untuk memperbaiki diri dan membantu pelanggan lain membuat keputusan yang lebih baik.

source: Continue Shopping
id: Lanjutkan Belanja

source: Total Amount
id: Total jumlah

source: Payment Method Selected
id: Metode pembayaran yang dipilih

# delete_account_label
source: Delete account
id: Hapus akun

source: Delete account confirmation
id: Konfirmasi hapus Akun

# delete_account_confirmation_desc
source: Are you sure you want to delete your account? This action is permanent and cannot be undone.
id: Apakah Anda yakin ingin menghapus akun Anda? Tindakan ini bersifat permanen dan tidak dapat dibatalkan.

# delete_account_confirmed
source: Delete account
id: Hapus Akun

# delete_account_success_title
source: Account Deleted
id: Akun terhapus

# delete_account_success_desc
source: Your Account deleted successfully
id: Akun Anda berhasil dihapus.

# give_rating_label
source: Give a rating
id: Berikan Ulasan

source: Sold
id: Terjual

source: No rating
id: Tidak ada ulasan

# pick_location_title
source: Pick a Location
id: Pilih Lokasi

# select_location_label
source: Select Location
id: Pilih Lokasi

source: Search for Address
id: Cari Alamat

# search_address_hint
source: Enter the district / city name
id: Masukkan nama kecamatan / kota

source: Zip code
id: Kode Pos

source: Type
id: Tipe

# error_not_fill_name
source: Please fill name data
id: Mohon masukkan nama

# error_not_fill_phone
source: Please fill phone number data
id: Mohon masukkan nomor telepon

# error_not_fill_address
source: Please fill address data
id: Mohon masukkan alamat

source: Save Address
id: Simpan Alamat

source: Added
id: Ditambahkan

source: edited
id: dirubah

source: Use current location
id: Gunakan lokasi saat ini

# no_available_product_title
source: No Available Product
id: Tidak ada produk yang tersedia

# no_available_product_desc
source: There are no available products for this event
id: Tidak ada produk yang tersedia untuk event ini

# no_available_product_price_desc
source: There are no available products on this price range
id: Tidak ada produk yang tersedia di rentan harga ini

# no_available_data_title
source: No Available Data
id: Tidak Ada Data

# no_available_data_desc
source: There is no data available for this transaction
id: Tidak ada data yang tersedia untuk transaksi ini

# no_notification_data_title
source: No Notification Yet
id: Belum Ada Pemberitahuan

# no_notification_data_desc
source: Start shopping and discover new products from our sellers today
id: Mulai berbelanja dan temukan produk baru dari penjual kami hari ini

source: Already Added
id: Telah Ditambahkan

source: Select
id: Pilih

# no_review_yet
source: No reviews yet for this product
id: Tidak ada ulasan untuk produk ini

# be_first_review
source: Be the first to leave a review and help others choose the right product!
id: Jadilah yang pertama untuk memberikan ulasan dan membantu orang lain memilih produk yang tepat!

# max_recipient_reached
source: maximum recipient reached!
id: Jumlah penerima maksimum telah tercapai!

# error_not_fill_zipcode
source: Please fill postal code
id: Mohon masukkan kodepos

# set_address_main
source: Set as Main
id: Jadikan Utama

source: Tracking number not available
id: Nomor pelacakan tidak tersedia

source: Product Price
id: Harga Produk

# shipping_cost
source: Shipping Costs
id: Biaya Pengiriman

source: Estimated Arrival
id: Perkiraan Kedatangan

source: Get Started
id: Mulai

# onboarding_title_1
source: Welcome to Untukmu Gifting AI
id: Selamat datang di Untukmu Gifting AI

# onboarding_subtitle_1
source: With Untukmu, gifting has never been easier. We''re here to help you make each occasion special, without the stress of finding the perfect gift.
id: Dengan Untukmu, memberi hadiah belum pernah semudah ini. Kami hadir untuk membantu Anda membuat setiap acara spesial tanpa stres dalam mencari hadiah yang sempurna.

# onboarding_title_2
source: Sync Your Calendar
id: Sinkronisasi Kalendermu

# onboarding_subtitle_2
source: Let us help you stay on top of important dates! Sync your online calendar with Untukmu so we can remind you of upcoming events and make personalized gift recommendations.
id: Biarkan kami membantumu mengingatkan tanggal penting! Sinkronisasikan kalender onlinemu dengan Untukmu sehingga kami dapat mengingatkanmu tentang acara yang akan datang dan memberikan rekomendasi hadiah yang dipersonalisasi.

# onboarding_title_3
source: Choose Your Gift
id: Pilih Hadiahmu

# onboarding_subtitle_3
source: Our AI-powered Gift Catalogue has something for everyone. Simply choose the occasion and let us handle the rest. With Untukmu, you''ll always give the perfect gift.
id: Katalog Hadiah kami yang didukung oleh kecerdasan buatan memiliki sesuatu untuk semua orang. Cukup pilih acaranya dan biarkan kami menanganinya. Dengan Untukmu, anda akan selalu memberikan hadiah yang sempurna.

source: Review
id: Ulasan

source: Event Calendar
id: Kalendar Event

source: No event running
id: Tidak ada Event berlangsung

source: Add Address
id: Tambahkan Alamat

# cant_find_contact_name_label
source: We can’t find that name
id: Kami tidak dapat menemukan nama tersebut

# cant_find_contact_name_desc
source: you can add more contact or find another name
id: Anda dapat menambahkan kontak atau menemukan nama lainnya

source: No birthday filled
id: Tidak ada tanggal lahir terisi

source: Contact Imported
id: Kontak telah terimport

# card_payment_title
source: Cards & Payment
id: Kartu & Pembayaran

# preferred_payment_method
source: Your preferred payment method
id: Metode pembayaran pilihanmu

source: Add Credit Card
id: Tambahkan Kartu Kredit

source: Payment Card Added
id: Kartu Pembayaran Ditambahkan

source: Payment Card Deleted
id: Kartu Pembayaran Dihapus

source: Upload Photo
id: Unggah Foto

# select_photo
source: Select a photo
id: Pilih foto

source: Capture Camera
id: Ambil Foto

source: Pick From Gallery
id: Pilih dari Galeri

# what_are_they_interested
source: What are they interested in?
id: Apa yang mereka minati?

source: Import Contact
id: Impor Kontak

source: Phone Contacts
id: Kontak Telepon

source: Select All
id: Pilih Semua

source: Unselect All
id: Batal Pilih Semua

# cant_find_name
source: We can’t find that name
id: Kami tidak dapat menemukan nama tersebut

# cant_add_more
source: you can add more contact or find another name
id: Anda tidak dapat menambahkan lebih banyak kontak atau mencari nama lain

source: Import
id: Impor

source: Quick Access
id: Akses cepat

source: Recommendation
id: Remendasi

# server_error_desc
source: There is an issue with the server, please try again in a few moments.
id: Terjadi kendala pada server, mohon ulangi beberapa saat lagi

source: Retry
id: Coba lagi

source: Remove Address
id: Hapus Alamat

source: Main
id: Utama

source: Delete
id: Hapus

# delete_address_confirmation
source: Delete Address?
id: Hapus Alamat?

# delete_address_confirmation_desc
source: Are you sure you want to delete this address?
id: Apakah anda yakin akan menghapus alamat ini?

# delete_address_success
source: Address Deleted
id: Alamat terhapus

# delete_address_success_desc
source: Address Deleted Successfully
id: Alamat telah berhasil dihapus

# pick_location_guide
source: click on the map to determine the location point
id: klik pada peta untuk menentukan titik lokasi

source: Coming Soon
id: Segera

source: Add Contact
id: Tambah Kontak

source: Import Phone Contact
id: Impor Kontak

source: Appearance
id: Tampilan

source: Update Profile
id: Update Profil

source: Change Photo
id: Ubah Foto

# how_can_we_help
source: How can we help you?
id: Bagaimana kami membantu Anda?

source: Start Conversation
id: Mulai Percakapan

source: Data not available
id: Data tidak tersedia

source: Add Event
id: Tambahkan Acara

source: Edit Event
id: Hapus Acara

source: Event Type
id: Jenis Acara

source: Event Title
id: Judul Acara

source: Input Event Title
id: Masukkan Judul Acara

source: For Who?
id: Untuk Siapa?

source: Optional
id: Opsional

# input_event_recipient
source: Input the event''s recipient
id: Masukkan penerima acara

source: Date of Event
id: Tanggal Acara

source: Input date of event
id: Masukkan tanggal acara

# input_notes
source: Add a note
id: Tambahkan catatan

source: Event added
id: Acara ditambahkan

source: Event edited
id: Event diubah

source: Event deleted
id: Event dihapus

source: Done
id: Selesai

source: Finish
id: Selesai

# finish_order_title
source: Finish Order
id: Selesaikan Pesanan

# finish_order_desc
source: By clicking Done, the funds will be transferred to the seller and you will not be able to file a complaint.
id: Setelah mengklik Selesai, dana akan segera dipindahkan kepada penjual dan anda tidak akan bisa mengajukan komplain.

source: Delete Event
id: Hapus Acara

# delete_event_confirmation
source: Delete This Event?
id: Hapus Acara Ini?

# delete_event_confirmation_desc
source: Are you sure to delete this event?
id: Apakah Anda ingin menghapus acara ini?

source: Select Type
id: Pilih Tipe

source: Select Address Type
id: Pilih Tipe Alamat

source: Yesterday
id: Kemarin

# chat_merchant_suggestion_1
source: Hi, is this gift product still available?
id: Apakah produk ini masih ada?

# chat_merchant_suggestion_2
source: Hi, is this product ready?
id: Apakah produk ini ready?

# chat_merchant_suggestion_3
source: When can it be shipped?
id: Kapan bisa dikirim?

# whatsapp_message_confirm_template
source: Hi {name}, Have you already receive gift from me? please confirm
id: Hi {name}, Apa anda sudah menerima hadiah dari saya? mohon konfirmasinya

source: Notification
id: Notifikasi

# transaction_status_all
source: All
id: Semua

# transaction_status_pending
source: Pending
id: Menunggu

# transaction_status_paid
source: Paid
id: Dibayar

# transaction_status_on_processed
source: On Process
id: Sedang Diproses

# transaction_status_shipped
source: Shipped
id: Mengirim

# transaction_status_delivered
source: Delivered
id: Terkirim

# transaction_status_done
source: Done
id: Selesai

source: Read All
id: Baca Semua

source: Send messages
id: Kirim Pesan

source: My Orders
id: Pesanan

source: Push Notification Setting
id: Pengaturan Push Notifikasi

# whatsapp_name
source: Name
id: Nama

# whatsapp_price
source: Price
id: Harga

# whatsapp_image
source: Image
id: Gambar

# whatsapp_order_product_greets
source: Hello, I want to order this product
id: Halo, saya mau pesan produk ini

# whatsapp_find_category_greets
source: I''m looking for the perfect gift and need some assistance. Can you help me find a {recommendation} that suits my needs? Here are some details about what I''m looking for: [Add more details].
id: Saya sedang mencari hadiah yang sempurna dan butuh bantuan. Bisakah Anda membantu saya menemukan {recommendation} yang sesuai dengan kebutuhan saya? Berikut beberapa detail tentang apa yang saya cari: [Tambahkan detail selengkapnya].

# whatsapp_button
source: Contact us on Whatsapp
id: Chat kami di Whatsapp

# whatsapp_dialog_title
source: Finding the perfect gift?
id: Menemukan hadiah yang sempurna?
